Map<String, Map<String, String>> ar = {
  "USD": {
    "name": "الدولار الأمريكي",
    "name_plural": "دولارات أمريكية",
  },
  "EUR": {
    "name": "اليورو",
    "name_plural": "يوروهات",
  },
  "JPY": {
    "name": "الين الياباني",
    "name_plural": "ين ياباني",
  },
  "GBP": {
    "name": "الجنيه الإسترليني",
    "name_plural": "جنيهات إسترلينية",
  },
  "AUD": {
    "name": "الدولار الأسترالي",
    "name_plural": "دولارات أسترالية",
  },
  "CAD": {
    "name": "الدولار الكندي",
    "name_plural": "دولارات كندية",
  },
  "CHF": {
    "name": "الفرنك السويسري",
    "name_plural": "فرنكات سويسرية",
  },
  "CNY": {
    "name": "اليوان الصيني",
    "name_plural": "يوان صيني",
  },
  "HKD": {
    "name": "الدولار الهونغ كونغي",
    "name_plural": "دولارات هونغ كونغية",
  },
  "NZD": {
    "name": "الدولار النيوزيلندي",
    "name_plural": "دولارات نيوزيلندية",
  },
  "SEK": {
    "name": "الكرونة السويدية",
    "name_plural": "كرونات سويدية",
  },
  "KRW": {
    "name": "الوون الكوري الجنوبي",
    "name_plural": "وون كوري جنوبي",
  },
  "SGD": {
    "name": "الدولار السنغافوري",
    "name_plural": "دولارات سنغافورية",
  },
  "NOK": {
    "name": "الكرونة النرويجية",
    "name_plural": "كرونات نرويجية",
  },
  "MXN": {
    "name": "البيزو المكسيكي",
    "name_plural": "بيزوهات مكسيكية",
  },
  "INR": {
    "name": "الروبية الهندية",
    "name_plural": "روبيات هندية",
  },
  "RUB": {
    "name": "الروبل الروسي",
    "name_plural": "روبلات روسية",
  },
  "ZAR": {
    "name": "الراند الجنوب أفريقي",
    "name_plural": "راند جنوب أفريقي",
  },
  "TRY": {
    "name": "الليرة التركية",
    "name_plural": "الليرة التركية",
  },
  "BRL": {
    "name": "الريال البرازيلي",
    "name_plural": "الريال البرازيلي",
  },
  "TWD": {
    "name": "الدولار التايواني الجديد",
    "name_plural": "الدولار التايواني الجديد",
  },
  "DKK": {
    "name": "الكرون الدنماركي",
    "name_plural": "الكرون الدنماركي",
  },
  "PLN": {
    "name": "زلوتي بولندي",
    "name_plural": "زلوتي بولندي",
  },
  "THB": {
    "name": "الباخت التايلاندي",
    "name_plural": "الباخت التايلاندي",
  },
  "IDR": {
    "name": "روبية إندونيسية",
    "name_plural": "روبية إندونيسية",
  },
  "HUF": {
    "name": "الفورينت الهنغاري",
    "name_plural": "الفورينت الهنغاري",
  },
  "CZK": {
    "name": "الكورونا التشيكية",
    "name_plural": "الكورونا التشيكية",
  },
  "ILS": {
    "name": "الشيكل الإسرائيلي",
    "name_plural": "الشيكل الإسرائيلي",
  },
  "CLP": {
    "name": "بيزو تشيلي",
    "name_plural": "بيزو تشيلي",
  },
  "PHP": {
    "name": "البيزو الفلبيني",
    "name_plural": "البيزو الفلبيني",
  },
  "AED": {
    "name": "الدرهم الإماراتي",
    "name_plural": "الدرهم الإماراتي",
  },
  "COP": {
    "name": "بيزو كولومبي",
    "name_plural": "بيزو كولومبي",
  },
  "SAR": {
    "name": "الريال السعودي",
    "name_plural": "الريال السعودي",
  },
  "MYR": {
    "name": "الرينجيت الماليزي",
    "name_plural": "الرينجيت الماليزي",
  },
  "RON": {
    "name": "ليو روماني",
    "name_plural": "ليو روماني",
  }, "AFN": {
    "name": "أفغاني",
    "name_plural": "أفغاني أفغانستاني",
  },
  "ARS": {
    "name": "بيزو أرجنتيني",
    "name_plural": "بيزو أرجنتيني",
  },
  "BBD": {
    "name": "دولار بربادوسي",
    "name_plural": "دولار بربادوسي",
  },
  "BDT": {
    "name": "تاكا بنجلاديشي",
    "name_plural": "تاكا بنجلاديشي",
  },
  "BGN": {
    "name": "ليف بلغاري",
    "name_plural": "ليف بلغاري",
  },
  "BHD": {
    "name": "دينار بحريني",
    "name_plural": "دينار بحريني",
  },
  "BMD": {
    "name": "دولار برمودي",
    "name_plural": "دولار برمودي",
  },
  "BND": {
    "name": "دولار بروناي",
    "name_plural": "دولار بروناي",
  },
  "BOB": {
    "name": "بوليفيانو بوليفي",
    "name_plural": "بوليفيانو بوليفي",
  },
  "BTN": {
    "name": "نغولتروم بهوتاني",
    "name_plural": "نغولتروم بهوتاني",
  },
  "BZD": {
    "name": "دولار بليزي",
    "name_plural": "دولار بليزي",
  },
  "CRC": {
    "name": "كولون كوستاريكي",
    "name_plural": "كولون كوستاريكي",
  },
  "DOP": {
    "name": "بيزو دومينيكاني",
    "name_plural": "بيزو دومينيكاني",
  },
  "EGP": {
    "name": "جنيه مصري",
    "name_plural": "جنيه مصري",
  },
  "ETB": {
    "name": "بير إثيوبي",
    "name_plural": "بير إثيوبي",
  },
  "GEL": {
    "name": "لاري جورجي",
    "name_plural": "لاري جورجي",
  },
  "GHS": {
    "name": "سيدي غاني",
    "name_plural": "سيدي غاني",
  }, "GMD": {
    "name": "دالاسي جامبي",
    "name_plural": "دالاسي جامبي",
  },
  "GYD": {
    "name": "دولار جويانا",
    "name_plural": "دولار جويانا",
  },
  "HRK": {
    "name": "كونا كرواتية",
    "name_plural": "كونا كرواتية",
  },
  "ISK": {
    "name": "كرونا آيسلندية",
    "name_plural": "كرونا آيسلندية",
  },
  "JMD": {
    "name": "دولار جامايكي",
    "name_plural": "دولار جامايكي",
  },
  "KES": {
    "name": "شلن كيني",
    "name_plural": "شلن كيني",
  },
  "KWD": {
    "name": "دينار كويتي",
    "name_plural": "دينار كويتي",
  },
  "KYD": {
    "name": "دولار جزر كايمان",
    "name_plural": "دولار جزر كايمان",
  },
  "KZT": {
    "name": "تينغ كازاخستاني",
    "name_plural": "تينغ كازاخستاني",
  },
  "LAK": {
    "name": "كيب لاوسي",
    "name_plural": "كيب لاوسي",
  },
  "LKR": {
    "name": "روبية سريلانكية",
    "name_plural": "روبية سريلانكية",
  },
  "LRD": {
    "name": "دولار ليبيري",
    "name_plural": "دولار ليبيري",
  },
  "MAD": {
    "name": "درهم مغربي",
    "name_plural": "درهم مغربي",
  },
  "MDL": {
    "name": "ليو مولدوفي",
    "name_plural": "ليو مولدوفي",
  },
  "MKD": {
    "name": "دينار مقدوني",
    "name_plural": "دينار مقدوني",
  },
  "MNT": {
    "name": "توغريك منغولي",
    "name_plural": "توغريك منغولي",
  },
  "MUR": {
    "name": "روبية موريشيوسية",
    "name_plural": "روبية موريشيوسية",
  },
  "MWK": {
    "name": "كواشا مالاوي",
    "name_plural": "كواشا مالاوي",
  },
  "MZN": {
    "name": "متيكال موزمبيقي",
    "name_plural": "متيكال موزمبيقي",
  }, "NAD": {
    "name": "دولار ناميبي",
    "name_plural": "دولارات ناميبية",
  },
  "NGN": {
    "name": "نايرا نيجيرية",
    "name_plural": "نيرات نيجيرية",
  },
  "NIO": {
    "name": "كوردوبا نيكاراغوا",
    "name_plural": "كوردوبا نيكاراغوا",
  },
  "NPR": {
    "name": "روبية نيبالية",
    "name_plural": "روبيات نيبالية",
  },
  "OMR": {
    "name": "ريال عماني",
    "name_plural": "ريالات عمانية",
  },
  "PEN": {
    "name": "سول بيروفي",
    "name_plural": "سولات بيروفية",
  },
  "PGK": {
    "name": "كينا بابوا غينيا الجديدة",
    "name_plural": "كينا بابوا غينيا الجديدة",
  },
  "PKR": {
    "name": "روبية باكستانية",
    "name_plural": "روبيات باكستانية",
  },
  "PYG": {
    "name": "جواراني باراغواي",
    "name_plural": "جواراني باراغواي",
  },
  "QAR": {
    "name": "ريال قطري",
    "name_plural": "ريالات قطرية",
  },
  "RSD": {
    "name": "دينار صربي",
    "name_plural": "دنانير صربية",
  },
  "SOS": {
    "name": "شلن صومالي",
    "name_plural": "شلن صومالي",
  },
  "SRD": {
    "name": "دولار سورينامي",
    "name_plural": "دولار سورينامي",
  },
  "TTD": {
    "name": "دولار ترينيداد وتوباغو",
    "name_plural": "دولار ترينيداد وتوباغو",
  },
  "TZS": {
    "name": "شلن تنزاني",
    "name_plural": "شلن تنزاني",
  },
  "UAH": {
    "name": "هريفنيا أوكرانية",
    "name_plural": "هريفنيا أوكرانية",
  },
  "UGX": {
    "name": "شلن أوغندي",
    "name_plural": "شلن أوغندي",
  },
  "UYU": {
    "name": "بيزو أوروغواي",
    "name_plural": "بيزو أوروغواي",
  },
  "VEF": {
    "name": "بوليفار فنزويلي",
    "name_plural": "بوليفار فنزويلي",
  },
  "VND": {
    "name": "دونج فيتنامي",
    "name_plural": "دونج فيتنامي",
  },
  "YER": {
    "name": "ريال يمني",
    "name_plural": "ريال يمني",
  },
  "ALL": {
    "name": "ليك ألباني",
    "name_plural": "ليك ألباني",
  },
  "AMD": {
    "name": "درام أرميني",
    "name_plural": "درام أرميني",
  },
  "AZN": {
    "name": "مانات أذربيجاني",
    "name_plural": "مانات أذربيجاني",
  },
  "BIF": {
    "name": "فرنك بروندي",
    "name_plural": "فرنك بروندي",
  },
  "BWP": {
    "name": "بولا بوتسواني",
    "name_plural": "بولا بوتسواني",
  },
  "BYN": {
    "name": "روبل بيلاروسي",
    "name_plural": "روبل بيلاروسي",
  },
};
